reddit_on_rails/app/controllers/application_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def is_moderator?
    current_user.id == Sub.find_by(id: params[:id]).user_id