reddit_on_rails/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @post.sub_id = Sub.find_by(id: params[:id]).id
    if @post.save
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "yo"], ["url", "hi.com"], ["content", "post"], ["sub_id", 1], ["author_id", 4], ["created_at", "2018-09-18 23:40:25.498397"], ["updated_at", "2018-09-18 23:40:25.498397"]]