reddit_on_rails/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "beep"], ["description", "beep"], ["user_id", 4], ["created_at", "2018-09-18 23:18:58.228864"], ["updated_at", "2018-09-18 23:18:58.228864"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.user_id = current_user.id
    if @sub.save